In [1]:

import pandas as pd
technologies= {
    'Courses':["Spark","PySpark","Spark","Java","PySpark","PHP"],
    'Fee' :[22000,25000,23000,24000,26000,27000],
    'Duration':['30days','50days','30days','60days','35days','30days']
          }
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration
0    Spark  22000   30days
1  PySpark  25000   50days
2    Spark  23000   30days
3     Java  24000   60days
4  PySpark  26000   35days
5      PHP  27000   30days

In [3]:
# Filter columns
df.filter(items=['Courses','Fee'])

   Courses    Fee
0    Spark  22000
1  PySpark  25000
2    Spark  23000
3     Java  24000
4  PySpark  26000
5      PHP  27000

In [4]:
# Filter Columns using like

df.filter(like='ration',axis=1)

  Duration
0   30days
1   50days
2   30days
3   60days
4   35days
5   30days

In [5]:
# To filter columns with regular expressions, use regex param. The below example filters column that ends with the character e.

df.filter(regex='e',axis=1)

   Courses    Fee
0    Spark  22000
1  PySpark  25000
2    Spark  23000
3     Java  24000
4  PySpark  26000
5      PHP  27000

In [7]:
df.filter(items=[3,4,5],axis=0)

   Courses    Fee Duration
3     Java  24000   60days
4  PySpark  26000   35days
5      PHP  27000   30days

In [8]:
# Use like param to filter rows that match with substring. For our example, this doesn’t make sense 
# as we have a numeric index. however, below is an example that demonstrates the usage of like param.

df.filter(like='4',axis=0)

   Courses    Fee Duration
4  PySpark  26000   35days

Where Condition

In [ ]:

# DataFrame.where() syntax
# DataFrame.where(cond, other=nan, inplace=False, axis=None, level=None, errors='raise', try_cast=NoDefault.no_default)

In [10]:
# Create DataFrame
import pandas as pd
import numpy as np
technologies= {
    'Courses':["Spark","PySpark","Spark","Python","PySpark"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Discount':[1500,1000,1200,800,1300],
    'Duration':['30days','50days','30days','35days','40days']
          }
df = pd.DataFrame(technologies)
df

   Courses    Fee  Discount Duration
0    Spark  22000      1500   30days
1  PySpark  25000      1000   50days
2    Spark  23000      1200   30days
3   Python  24000       800   35days
4  PySpark  26000      1300   40days

In [ ]:
# In pandas where() function behaves differently than SQL where clause, here it is used similar to if then/if else. It checks one or multiple conditions specified with 
# cond param and replace with a other value when condition becomes False.

In [11]:
df.where(df['Fee']>23000)

   Courses      Fee  Discount Duration
0      NaN      NaN       NaN      NaN
1  PySpark  25000.0    1000.0   50days
2      NaN      NaN       NaN      NaN
3   Python  24000.0     800.0   35days
4  PySpark  26000.0    1300.0   40days

In [ ]:
# Now, let’s update with a custom value. 
# The below example updates all rows of DataFrame with value ‘NA’ when condition Fee > 23000 becomes False

In [12]:
df.where(df['Fee']>23000,'NA')

   Courses    Fee Discount Duration
0       NA     NA       NA       NA
1  PySpark  25000     1000   50days
2       NA     NA       NA       NA
3   Python  24000      800   35days
4  PySpark  26000     1300   40days

# Multiple Columns & Conditions

In [17]:
df.where(df['Fee']>23000 & df['Discount']>900,'NA')

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [18]:
c1 = df['Fee'] > 23000

c2 = df['Discount']>900

df.where(c1&c2,other='NA')

   Courses    Fee Discount Duration
0       NA     NA       NA       NA
1  PySpark  25000     1000   50days
2       NA     NA       NA       NA
3       NA     NA       NA       NA
4  PySpark  26000     1300   40days